from typing import List, Literal, get_args

# Create a single Literal type that includes all allowed values from each subgroup.
AllowedBasicKnowledge = Literal[
    # ปูนซีเมนต์_ปูน_คอนกรีต_เหล็ก_เสาเข็ม
    "ปูน_ก่อ_ฉาบ_เท",
    "ปูนกาวซีเมนต์",
    "ปูนฉาบ_ปูนลอฟท์_ปูนซีเมนต์ตกแต่ง",
    "ปูนซีเมนต์โครงสร้าง",
    "ปูนเสือมอร์ตาร์_ปูนซีเมนต์สำเร็จรูป",
    "ผ้าใบคอนกรีต",
    "หิน_ทราย",
    "อิฐมวลเบา_เคาน์เตอร์มวลเบา",
    "เสาเข็ม_แผ่นพื้น_รั้วคอนกรีตสำเร็จรูป",
    "เหล็ก",
    # พื้น_ผนัง_ฝ้าและวัสดุตกแต่ง
    "กระเบื้องปูพื้นและผนัง",
    "บล็อกปูพื้น_กระเบื้องคอนกรีต_รั้วและอุปกรณ์ตกแต่งสวน",
    "ประตู_หน้าต่าง_และอุปกรณ์",
    "รางน้ำ",
    "อุปกรณ์ปูกระเบื้องปูพื้นและผนัง",
    "แผ่นกันเสียง_แผ่นซับเสียง",
    "แผ่นปูพื้นไวนิล_SPC_ลามิเนต_WPC",
    "แผ่นยิปซั่มบอร์ด",
    "แผ่นสมาร์ทบอร์ด_ซีเมนต์บอร์ดและซีเมนต์วูด",
    "ไม้สังเคราะห์_ไม้เทียม",
    "ผนังกันเสียง",
    # งานระบบ
    "ฉนวนกันความร้อน",
    "ฉนวนกันเสียง",
    "ถังเก็บน้ำ_ถังบำทัด_ถังดักไขมัน",
    "ท่อ_และอุปกรณ์ประปา",
    "ปั๊มน้ำ",
    # หลังคา
    "กระเบื้องหลังคาเซรามิก",
    "กระเบื้องหลังคาคอนกรีต",
    "กระเบื้องหลังคาไฟเบอร์ซีเมนต์",
    "อุปกรณ์ติดตั้งหลังคา",
    "กระเบื้องโปร่งแสงและแผ่นโปร่งแสง",
    "ชุดกระเบื้องระบายอากาศ",
    "หลังคาเมทัลชีท",
    # ห้องครัว
    "ก็อก_ซิงค์ล้างจาน",
    "ชุดครัวสำเร็จรูป",
    "เครื่องใช้ไฟฟ้าและอุปกรณ์ในครัว",
    "เคาน์เตอร์ครัวสำเร็จรูป",
    "เฟอร์นิเจอร์ครัว",
    # ห้องน้ำ
    "สุขภัณฑ์",
    "ก๊อกน้ำ_ฝักบัว",
    "อ่างล้างหน้า",
    "อุปกรณ์ห้องน้ำ",
    # เครื่องมือช่าง_ฮาร์ดแวร์_และ_DIY
    "บันได",
    "รถเข็นอเนกประสงค์",
    "เครื่องมือช่าง",
    # สีและเคมีภันฑ์
    "ซิลิโคนอเนกประสงค์_กาว_อะคริลิก",
    "วัสดุประสานและอุดรอยต่อ",
    "แนะนำสินค้าหรือบริการ",
    "สินค้าขายดี",
    "สินค้าใหม่",
    "ที่ไล่นก_ที่กันนก",
    "ตะแกรงกันใบไม้",
    # เครื่องช่วยนอน / อุปกรณ์ช่วยนอน
    "อุปกรณ์เพื่อช่วยให้นอนหลับสบาย",
]


def getBasicKnowledge() -> List[str]:
    return list(get_args(AllowedBasicKnowledge))


def formatLiteralList(items: list[str]) -> str:
    return "- " + ("\n- ".join(items)) + "\n"
